КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПунктыМаршрута/КонтурЛогистика_ПунктыМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ПунктыМаршрута</name>
  <attributes>
    <name>GLN</name>
    <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИндекс</name>
    <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКодРегион</name>
    <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнфАдрес</name>
    <comment>(вариант 1) Текстовое представление адреса - обязательно при указании адреса простым текстом</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнфКодСтраны</name>
    <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресГород</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаселПункт</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресУлица</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРайон</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДом</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКорпус</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКварт</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <comment>Нормализованное текстовое представление адреса по ГАР/ФИАС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодГАР</name>
    <comment>может быть указан вместо всех других адресных полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресГАРЗначение</name>
    <comment>JSON структуры адреса ФИАС/ГАР для исходящего XDTO</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКАдресу</name>
    <comment>необязательный, передается в сообщении для всех способов задания адреса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наш</name>
    <comment>если да, то становятся доступными расширенные настройки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправление</name>
    <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Прибытие</name>
    <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <comment>обязателен для пунктов отгрузки. ОрганизацияДиадок, являющаяся собственником пункта маршрута. Или укажите причину почему нет данных в реквизите СобственникНеУказанПричина</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственникНеУказанПричина</name>
    <comment>текстовое описание причины по которой для точки отгрузки нет сведений о её собственнике</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступКОбъектуДоговор</name>
    <comment>ОснДостОбИнфрДок - на основании чего пользуемся складом</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступКОбъектуТекст</name>
    <comment>ОснДостОбИнфрТекст  - Основание беспрепятственного доступа к объекту инфраструктуры пункта погрузки лица, осуществляющего погрузку груза в транспортное средство: текст при отсутствии подтверждающих документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ПунктМаршрутаУчетнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТелефоныПереадресующегоПоУмолчанию</name>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактыПолучателейУведомлений</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТрНЗамечанияОтВодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНЗамечанияОтПеревозчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНОтказПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНОтказГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПунктыМаршрута/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьОписаниеКлючейПоиска() Экспорт
	
	// Поиск договора осуществляется по:
	// 1. Адрес строкой
	// 2. Город, Улица, Дом, Корпус, Квартира
	// 3. Населенный пункт, Улица, Дом, Корпус, Квартира
	
	ШаблонСтрокиПоиска = " И КонтурЛогистика_Справочник.%1 = &%1";
	
	КлючиПоиска = Новый Массив;
	
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"КодГАР", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"АдресИнфАдрес", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"АдресГород,АдресУлица,АдресДом,АдресКорпус,АдресКварт", ШаблонСтрокиПоиска);
	КонтурЛогистика_КонвертацияСервер.ДобавитьНовоеУсловиеПоискаПоКлючам(КлючиПоиска,
		"АдресНаселПункт,АдресУлица,АдресДом,АдресКорпус,АдресКварт", ШаблонСтрокиПоиска);
	
	Возврат КлючиПоиска;
	
КонецФункции

Функция ТекстОшибкиНеЗаполненыКлючевыеРеквизиты() Экспорт
	
	ТекстОшибки = "Ошибка при поиске Пункта маршрута. Не заполнен один из ключевых реквизитов в одном из вариантов поиска:
		|1. Код ГАР
		|2. Строковое представление адреса
		|3. Город + Улица + Дом + Корпус + Квартира
		|4. Населенный пункт, Улица, Дом, Корпус, Квартира";
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ПредставлениеАдреса_(ПунктМаршрута) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПунктМаршрута", ПунктМаршрута);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПунктыМаршрута.Наименование КАК Наименование,
	|	КонтурЛогистика_ПунктыМаршрута.GLN КАК GLN,
	|	КонтурЛогистика_ПунктыМаршрута.АдресИндекс КАК АдресИндекс,
	|	КонтурЛогистика_ПунктыМаршрута.АдресКодРегион КАК АдресКодРегион,
	|	КонтурЛогистика_ПунктыМаршрута.АдресИнфАдрес КАК АдресИнфАдрес,
	|	КонтурЛогистика_ПунктыМаршрута.АдресИнфКодСтраны КАК АдресИнфКодСтраны,
	|	КонтурЛогистика_ПунктыМаршрута.АдресГород КАК АдресГород,
	|	КонтурЛогистика_ПунктыМаршрута.АдресНаселПункт КАК АдресНаселПункт,
	|	КонтурЛогистика_ПунктыМаршрута.АдресУлица КАК АдресУлица,
	|	КонтурЛогистика_ПунктыМаршрута.АдресРайон КАК АдресРайон,
	|	КонтурЛогистика_ПунктыМаршрута.АдресДом КАК АдресДом,
	|	КонтурЛогистика_ПунктыМаршрута.АдресКорпус КАК АдресКорпус,
	|	КонтурЛогистика_ПунктыМаршрута.АдресКварт КАК АдресКварт,
	|	КонтурЛогистика_ПунктыМаршрута.КодГАР КАК КодГАР,
	|	КонтурЛогистика_ПунктыМаршрута.АдресПредставление КАК АдресПредставление
	|ИЗ
	|	Справочник.КонтурЛогистика_ПунктыМаршрута КАК КонтурЛогистика_ПунктыМаршрута
	|ГДЕ
	|	КонтурЛогистика_ПунктыМаршрута.Ссылка = &ПунктМаршрута";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат ПредставлениеАдресаПоДанным(Выборка, "");
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеАдресаПоДанным(Данные, Префикс) Экспорт
	
	Если ЗначениеЗаполнено(Данные[Префикс + "АдресПредставление"]) Тогда
		Возврат Данные[Префикс + "АдресПредставление"];
	КонецЕсли;
	
	НаименованиеПоПолям = СокрЛП("" +
		?(ЗначениеЗаполнено(Данные[Префикс + "АдресГород"]), Данные[Префикс + "АдресГород"] + ", ", "")  +
		?(ЗначениеЗаполнено(Данные[Префикс + "АдресНаселПункт"]), Данные[Префикс + "АдресНаселПункт"] + ", ", "") +
		?(ЗначениеЗаполнено(Данные[Префикс + "АдресУлица"]), Данные[Префикс + "АдресУлица"] + ", ", "") +
		Данные[Префикс + "АдресДом"]);
		
	Если ЗначениеЗаполнено(Данные[Префикс + "АдресГород"]) Или ЗначениеЗаполнено(Данные[Префикс + "АдресНаселПункт"]) Тогда
		
		ТекстАдреса = НаименованиеПоПолям;
		
	ИначеЕсли ЗначениеЗаполнено(Данные[Префикс + "АдресИнфАдрес"]) Тогда
		
		ТекстАдреса = Данные[Префикс + "АдресИнфАдрес"];
		
	ИначеЕсли ЗначениеЗаполнено(Данные[Префикс + "КодГАР"]) Тогда
		
		ТекстАдреса = Данные[Префикс + "КодГАР"];
		
	ИначеЕсли ЗначениеЗаполнено(Данные[Префикс + "АдресКодРегион"]) Или ЗначениеЗаполнено(Данные[Префикс + "АдресИндекс"]) Тогда
		
		ТекстАдреса = Данные[Префикс + "АдресИндекс"] + " регион: " + Данные[Префикс + "АдресКодРегион"] + " " + НаименованиеПоПолям;
		
	Иначе
		
		ТекстАдреса = "";
		
	КонецЕсли;
	
	Возврат ТекстАдреса;
	
КонецФункции

Функция ОбязательныеРеквизиты() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("АдресИнфАдрес");
	МассивОбязательных.Добавить("АдресИнфКодСтраны");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция УсловноОбязательныеРеквизиты() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("Собственник");
	
	Возврат МассивОбязательных;
	
КонецФункции

// Имена реквизитов пункта, по которым собирается адрес в XML.
//
// Возвращаемое значение:
//  Строка
//
Функция ИменаРеквизитовАдресаДляВыгрузкиВXML() Экспорт
	
	Возврат "КодГАР, АдресКодРегион, АдресИндекс, АдресИнфАдрес, АдресПредставление";
	
КонецФункции

// Возвращает Истина, если данных адреса достаточно для обязательного тега Адрес в XML.
//
// Параметры:
//  ДанныеАдреса - Структура, Неопределено - реквизиты пункта маршрута.
//
// Возвращаемое значение:
//  Булево
//
Функция АдресДостаточенДляВыгрузкиВXML(ДанныеАдреса) Экспорт
	
	Если ДанныеАдреса = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеАдреса.КодГАР) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеАдреса.АдресКодРегион)
		И ЗначениеЗаполнено(ДанныеАдреса.АдресИндекс) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеАдреса.АдресИнфАдрес)
		И Не КонтурЛогистика_АдресаФИАССервер.ЭтоСлабоеПредставлениеАдресаГАР(
			ДанныеАдреса.АдресИнфАдрес, ДанныеАдреса.КодГАР) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеАдреса.АдресПредставление)
		И Не КонтурЛогистика_АдресаФИАССервер.ЭтоСлабоеПредставлениеАдресаГАР(
			ДанныеАдреса.АдресПредставление, ДанныеАдреса.КодГАР) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
